tutorials/cfdemSolverPiso/ErgunTestMPI_restart/CFD/constant/couplingProperties_init
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings
verbous;
modelType "A"; // A or B

couplingInterval 100;

voidFractionModel divided;

locateModel engine;

meshMotionModel noMeshMotion;

regionModel allRegion;

IOModel "basicIO";

dataExchangeModel twoWayMPI;//twoWayFiles;//oneWayVTK;//

averagingModel dense;//dilute;//

clockModel off;

forceModels
(
    //GidaspowDrag
    DiFeliceDrag
    //KochHillDrag
    gradPForce
    viscForce
    //Archimedes
    //volWeightedAverage
    //totalMomentumExchange
);

momCoupleModels
(
    implicitCouple
);

turbulenceModelType "RASProperties";//"LESProperties";//

//===========================================================================//
// sub-model properties

implicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}

ArchimedesProps
{
    densityFieldName "rho";
    gravityFieldName "g";
}
gradPForceProps
{
    pFieldName "p";
    densityFieldName "rho";
    voidfractionFieldName "voidfraction";
    velocityFieldName "U";
    //interpolation;
}

viscForceProps
{
    velocityFieldName "U";
    densityFieldName "rho";
    interpolation;
}
volWeightedAverageProps
{
    scalarFieldNames
    (
        voidfraction
    );
    vectorFieldNames
    (
    );
    upperThreshold 0.999;
    lowerThreshold 0;
    verbous;
}
totalMomentumExchangeProps
{
    implicitMomExFieldName "Ksl";
    explicitMomExFieldName "none";
    fluidVelFieldName "U";
    granVelFieldName "Us";
    densityFieldName "rho";
}
GidaspowDragProps
{
    velFieldName "U";
    densityFieldName "rho";
}
DiFeliceDragProps
{
    velFieldName "U";
    densityFieldName "rho";
    voidfractionFieldName "voidfraction";
}

KochHillDragProps
{
    velFieldName "U";
    densityFieldName "rho";
}

virtualMassForceProps
{
    velFieldName "U";
    densityFieldName "rho";
}

oneWayVTKProps
{
    couplingFilename "vtk_out%4.4d.vtk";
    maxNumberOfParticles 30000;
}

twoWayFilesProps
{
    maxNumberOfParticles 10100;
}

centreProps
{
    alphaMin 0.10;
}

engineProps
{
    treeSearch true;
}

dividedProps
{
    alphaMin 0.1;
    scaleUpVol 1.0;
}

twoWayMPIProps
{
    maxNumberOfParticles 10100;
    liggghtsPath "../DEM/in.liggghts_resume";
}
// ************************************************************************* //
